{
  "architectures": ["Qwen3ForCausalLM"],
  "model_type": "qwen3",
  "attention_bias": false,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "intermediate_size": 3072,
  "max_position_embeddings": 40960,
  "num_attention_heads": 16,
  "num_hidden_layers": 2,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "rms_norm_eps": 1e-6,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": 2048,
  "tie_word_embeddings": true,
  "use_sliding_window": true,
  "vocab_size": 151936
}
